/// Функція для знаходження довжини найдовшої зростаючої підпослідовності
var lengthOfLIS = function (nums) {
  /// масив для збереження хвостів підпослідовностей
  let tails = new Array(nums.length).fill(0);
  // розмір найдовшої підпослідовності
  let size = 0;
  // перебір елементів масиву
  for (let x of nums) {
    // ініціалізація меж для бінарного пошуку
    let i = 0,
      // права межа
      j = size;
    // бінарний пошук
    while (i !== j) {
      //// знаходження середини
      let m = Math.floor((i + j) / 2);
      /// порівняння з хвостом
      if (tails[m] < x) {
        // рух праворуч
        i = m + 1;
        // рух ліворуч
      } else {
        j = m;
      }
    }
    /// оновлення хвостів
    tails[i] = x;
    if (i === size) ++size;
  }
  return size;
};
